Tekla Open API Reference for Tekla Structures 2025
IGeometryNode Interface
 The IGeometryNode interface represents geometry tree node. This is implemented by concrete classes for the various types of geometry nodes
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IGeometryNode
Public Interface IGeometryNode
The IGeometryNode type exposes the following members.
Properties
Name | Description
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (i.e. false if it was originally a user-defined part)
Top
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern
Clone
 Creates a new object that is a copy of the current instance.
Top
See Also
Reference
Tekla.Structures.Model Namespace